In [1]:
import numpy as np
import pandas as pd

In [2]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [3]:
#now if we want to reindex, use
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [12]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0,2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [14]:
obj3.reindex(np.arange(6), method="ffill")
#fffill - it fills the NaN value with the value before it
#for series, reindex can only change the value of the index

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [16]:
#with dataframe, reindex can alter row (index), column or both
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),index=["a", "c", "d"],columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [18]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2
# here we are reindexing the row. Because we added row "b" hence its value will be NaN

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [19]:
frame3 = frame.reindex(columns=["Texas", "Utah", "California"])
frame3
#we added new column "Utah", hence the value NaN

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [20]:
#there are two more methods to achieve the above two
state = states = ["AB", "CD", "EF"]
frame3 = frame.reindex(columns=state)
frame3

   AB  CD  EF
a NaN NaN NaN
c NaN NaN NaN
d NaN NaN NaN

In [22]:
states = ["State1", "state2", "state3"]
frame3 = frame.reindex(states, axis="columns")
frame3

   State1  state2  state3
a     NaN     NaN     NaN
c     NaN     NaN     NaN
d     NaN     NaN     NaN

In [24]:
#dropping entries from axis
#5. here means float
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [25]:
#if we want to drop index c
obj2 = obj.drop("c")
obj2

a    0
b    1
d    3
e    4
dtype: int64

In [26]:
#if we want to drop d and e
obj3 = obj.drop(["d","e"])
obj3

a    0
b    1
c    2
dtype: int64

In [28]:
#for data frames, index value can be deleted from either axis
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [29]:
data.drop(index=["Ohio","Utah"])

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [31]:
data.drop(columns=["one","two"])

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

In [32]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [33]:
data.drop("one", axis=1)

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [35]:
data.drop(["one","two"], axis="columns")

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

In [36]:
data.drop(["Ohio"], axis="index")

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [40]:
#Indexing, Selection, and Filtering
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [39]:
print(obj["b"])

1.0

In [42]:
print(obj[1])

1.0

C:\Users\SONY\AppData\Local\Temp\ipykernel_6132\397599935.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(obj[1])

In [43]:
print(obj["a":"c"]) #it will not print the value of d

a    0.0
b    1.0
c    2.0
dtype: float64

In [47]:
print(obj[0:3]) #it will print from a whose index is 0 and upto 2. it will not include 3

a    0.0
b    1.0
c    2.0
dtype: float64

In [58]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [59]:
obj1

2    1
0    2
1    3
dtype: int64

In [60]:
obj1[[0,1,2]]

0    2
1    3
2    1
dtype: int64

In [72]:
obj1.loc[[0,1,2]]

0    2
1    3
2    1
dtype: int64

In [65]:
obj2

a    1
b    2
c    3
dtype: int64

In [67]:
obj2[["c", "b", "a"]]

c    3
b    2
a    1
dtype: int64

In [68]:
obj2.loc[["c", "b", "a"]]

c    3
b    2
a    1
dtype: int64

In [70]:
#obj2.loc[[0,1,2]] #it will give error

In [71]:
obj1

2    1
0    2
1    3
dtype: int64

In [74]:
obj1.iloc[[0,1,2]] #it will not change the order

2    1
0    2
1    3
dtype: int64

In [75]:
obj2

a    1
b    2
c    3
dtype: int64

In [76]:
obj.iloc[[0,1,2]] #it will not give any error

a    0.0
b    1.0
c    2.0
dtype: float64

In [77]:
obj2

a    1
b    2
c    3
dtype: int64

In [79]:
obj2.loc["b":"c"] = 5
obj2

a    1
b    5
c    5
dtype: int64